investigation_archive/benchmarks/64_concurrency_sparse.log
nohup: ignoring input
Token indices sequence length is longer than the specified maximum sequence length for this model (481349 > 262144). Running this sequence through the model will result in indexing errors
benchmark_args=Namespace(backend='sglang', base_url=None, host='127.0.0.1', port=31335, dataset_name='custom', dataset_path='/home/work/compass_max_posttrain_1/.cz/sala/oldMoney-Project/bench/competition_bench_64.jsonl', model=None, served_model_name=None, tokenizer=None, num_prompts=64, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=1024, random_output_len=1024, random_range_ratio=0.0, image_count=1, image_resolution='1080p', random_image_count=False, image_format='jpeg', image_content='random', request_rate=inf, use_trace_timestamps=False, max_concurrency=None, output_file=None, output_details=False, print_requests=False, disable_tqdm=False, disable_stream=False, return_logprob=False, return_routed_experts=False, seed=1, disable_ignore_eos=False, extra_request_body=None, apply_chat_template=False, profile=False, plot_throughput=False, profile_activities=['CPU', 'GPU'], profile_num_steps=None, profile_by_stage=False, profile_stages=None, lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=False, profile_prefill_url=None, profile_decode_url=None, flush_cache=True, warmup_requests=1, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256, gsp_range_ratio=1.0, gsp_fast_prepare=False, gsp_send_routing_key=False, gsp_num_turns=1, gsp_ordered=False, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', tag=None, header=None)
Namespace(backend='sglang', base_url=None, host='127.0.0.1', port=31335, dataset_name='custom', dataset_path='/home/work/compass_max_posttrain_1/.cz/sala/oldMoney-Project/bench/competition_bench_64.jsonl', model='/home/work/compass_max_posttrain_1/.cz/sala/model_gptq_int4_dense_smooth', served_model_name=None, tokenizer=None, num_prompts=64, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=1024, random_output_len=1024, random_range_ratio=0.0, image_count=1, image_resolution='1080p', random_image_count=False, image_format='jpeg', image_content='random', request_rate=inf, use_trace_timestamps=False, max_concurrency=None, output_file=None, output_details=False, print_requests=False, disable_tqdm=False, disable_stream=False, return_logprob=False, return_routed_experts=False, seed=1, disable_ignore_eos=False, extra_request_body=None, apply_chat_template=False, profile=False, plot_throughput=False, profile_activities=['CPU', 'GPU'], profile_num_steps=None, profile_by_stage=False, profile_stages=None, lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=False, profile_prefill_url=None, profile_decode_url=None, flush_cache=True, warmup_requests=1, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256, gsp_range_ratio=1.0, gsp_fast_prepare=False, gsp_send_routing_key=False, gsp_num_turns=1, gsp_ordered=False, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', tag=None, header=None)

#Input tokens: 9213034
#Output tokens: 216805
Starting warmup with 1 sequences...
Warmup completed with 1 sequences. Starting main benchmark run...
100%|██████████| 64/64 [27:38<00:00, 25.92s/it]

============ Serving Benchmark Result ============
Backend:                                 sglang    
Traffic request rate:                    inf       
Max request concurrency:                 not set   
Successful requests:                     64        
Benchmark duration (s):                  1658.88   
Total input tokens:                      9213034   
Total input text tokens:                 9213034   
Total generated tokens:                  216805    
Total generated tokens (retokenized):    204087    
Request throughput (req/s):              0.04      
Input token throughput (tok/s):          5553.78   
Output token throughput (tok/s):         130.69    
Peak output token throughput (tok/s):    1734.00   
Peak concurrent requests:                64        
Total token throughput (tok/s):          5684.47   
Concurrency:                             56.04     
----------------End-to-End Latency----------------
Mean E2E Latency (ms):                   1452527.17
Median E2E Latency (ms):                 1427925.71
P90 E2E Latency (ms):                    1529716.53
P99 E2E Latency (ms):                    1645819.48
---------------Time to First Token----------------
Mean TTFT (ms):                          688167.74 
Median TTFT (ms):                        495130.50 
P99 TTFT (ms):                           1415088.42
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          3181.30   
Median TPOT (ms):                        695.36    
P99 TPOT (ms):                           31722.54  
---------------Inter-Token Latency----------------
Mean ITL (ms):                           225.73    
Median ITL (ms):                         8.72      
P95 ITL (ms):                            31.67     
P99 ITL (ms):                            38.57     
Max ITL (ms):                            1405665.98
==================================================